#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``

<details><summary>Show Plan</summary>

```[command]/home/runner/work/_temp/1a41aea0-8ac2-45ce-8d58-5fd4949d2101/terraform-bin plan -input=false -no-color
random_string.random: Refreshing state... [id=ymzi27]
aws_acm_certificate.retrieval_covidshield: Refreshing state... [id=arn:aws:acm:us-east-1:445131834497:certificate/289d5579-f1b4-4060-911c-6e6ab6bc4715]
aws_wafv2_web_acl.key_retrieval_cdn: Refreshing state... [id=290c0829-fa25-4082-8a42-9467b4b29304]
aws_secretsmanager_secret.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz]
aws_secretsmanager_secret.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X]
aws_iam_role.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs]
aws_secretsmanager_secret.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm]
aws_secretsmanager_secret.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD]
aws_wafv2_ip_set.new_key_claim: Refreshing state... [id=26e4496f-65b1-4a72-b9b0-642e05452cf4]
aws_ecr_repository.repository["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_wafv2_web_acl.key_retrieval: Refreshing state... [id=6f2f44a7-242d-4626-996b-8919690096b6]
aws_ecr_repository.repository["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_ecr_repository.repository["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_iam_role.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E212DUJ8FH57AC]
aws_iam_role.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy]
aws_secretsmanager_secret.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN]
aws_acm_certificate.covidshield: Refreshing state... [id=arn:aws:acm:ca-central-1:445131834497:certificate/afa9146e-c959-477b-bbd3-caafa32bba53]
aws_vpc.covidshield: Refreshing state... [id=vpc-0f08d59ec610efa9f]
aws_route53_zone.covidshield: Refreshing state... [id=Z028665636H79UA5DVHCV]
aws_route53_health_check.covidshield_key_retrieval_healthcheck: Refreshing state... [id=40fadd9c-0b75-4b17-b478-cdf083a1dfe7]
aws_ecs_cluster.covidshield: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:cluster/CovidShield]
aws_route53_health_check.covidshield_key_submission_healthcheck: Refreshing state... [id=3150afd9-a1d6-4787-bbfb-99924327739d]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_ca_json: Refreshing state... [id=cd6f210a-78ce-4ba6-a90f-47e72a8b4753]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_region_json: Refreshing state... [id=bd344266-36ab-4a72-9b40-82855b3bde94]
aws_iam_role.codedeploy: Refreshing state... [id=codedeploy]
aws_secretsmanager_secret_version.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm|A7101EDF-0682-4BE6-8CF2-C656723D19CF]
aws_secretsmanager_secret_version.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz|6D05AB97-E512-4326-8313-38440FD6AA82]
aws_secretsmanager_secret_version.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X|ADE432F1-1B59-4B86-A53E-50F4ECC8A206]
aws_iam_role.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_iam_role.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_iam_role_policy.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs:vpc_flow_logs]
aws_ecr_lifecycle_policy.policy["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_ecr_lifecycle_policy.policy["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_ecr_lifecycle_policy.policy["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN|7C0BE3FC-47ED-4373-AFFC-5EFCD297A6FC]
aws_iam_role_policy_attachment.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy-2020090819343193090000000c]
aws_iam_role_policy.lambda_validate_codedeploy: Refreshing state... [id=lambda-validate-deploy:LambdaValidateCodeDeploy]
aws_s3_bucket.firehose_waf_logs: Refreshing state... [id=covid-shield-demo-waf-logs]
aws_s3_bucket.exposure_config: Refreshing state... [id=covid-shield-exposure-config-demo]
aws_kms_key.cw: Refreshing state... [id=db78cf66-2642-4829-bc44-2dd721e952f0]
aws_kms_key.cw_us_east: Refreshing state... [id=343f7858-fa06-4db4-b222-6519c0fe4735]
aws_s3_bucket.cloudfront_logs: Refreshing state... [id=covid-shield-demo-cloudfront-logs]
aws_route53_record.covidshield_certificate_validation["*.covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__1c28ba959650d936e6eeea7da23f069f.covid-alert-demo.cdssandbox.xyz._CNAME]
aws_iam_policy.covidshield_secrets_manager_key_submission: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidShieldSecretsManagerKeySubmission]
aws_route53_record.covidshield_certificate_validation["covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__1c28ba959650d936e6eeea7da23f069f.covid-alert-demo.cdssandbox.xyz._CNAME]
aws_route53_record.retrieval_covidshield_certificate_validation["retrieval.covid-alert-demo.cdssandbox.xyz"]: Refreshing state... [id=Z028665636H79UA5DVHCV__76fc87244e04f8cb562681bf007d9884.retrieval.covid-alert-demo.cdssandbox.xyz_CNAME]
aws_iam_role_policy_attachment.codedeploy: Refreshing state... [id=codedeploy-2020090819343151530000000b]
aws_wafv2_web_acl.key_submission: Refreshing state... [id=1dbee81d-3f78-4a42-adf0-beec8a1007b8]
aws_iam_policy.covidshield_secrets_manager_key_retrieval: Refreshing state... [id=arn:aws:iam::445131834497:policy/CovidShieldSecretsManagerKeyRetrieval]
aws_iam_role_policy_attachment.ecs_task_execution_key_submission: Refreshing state... [id=KeySubmission-2020090819343237630000000d]
aws_iam_role_policy_attachment.ecs_task_execution_key_retrieval: Refreshing state... [id=KeyRetrieval-2020090819343243930000000e]
aws_iam_role_policy_attachment.secrets_manager_key_submission: Refreshing state... [id=KeySubmission-20200908193433359000000010]
aws_sns_topic.alert_critical_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:445131834497:alert-critical]
aws_sns_topic.alert_warning_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:445131834497:alert-warning]
aws_iam_role_policy_attachment.secrets_manager_key_retrieval: Refreshing state... [id=KeyRetrieval-2020090819343333820000000f]
aws_acm_certificate_validation.covidshield: Refreshing state... [id=2020-09-09 18:38:31 +0000 UTC]
aws_acm_certificate_validation.retrieval_covidshield: Refreshing state... [id=2020-09-09 18:39:23 +0000 UTC]
aws_sns_topic.alert_critical: Refreshing state... [id=arn:aws:sns:ca-central-1:445131834497:alert-critical]
aws_cloudwatch_log_group.covidshield: Refreshing state... [id=CovidShield]
aws_sns_topic.alert_warning: Refreshing state... [id=arn:aws:sns:ca-central-1:445131834497:alert-warning]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_cloudwatch_metric_alarm.ddos_detected_route53: Refreshing state... [id=DDoSDetectedRoute53]
aws_cloudwatch_metric_alarm.route53_submission_health_check: Refreshing state... [id=Route53SubmissionHealthCheck]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_ca_json: Refreshing state... [id=Route53RetrievalHealthCheckCAJson]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_region_json: Refreshing state... [id=Route53RetrievalHealthCheckRegionJson]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check: Refreshing state... [id=Route53RetrievalHealthCheck]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalCritical: Refreshing state... [id=DiagnosisKeyTotalCritical]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalCritical: Refreshing state... [id=UnclaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalCritical: Refreshing state... [id=ClaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalWarn: Refreshing state... [id=ClaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalWarn: Refreshing state... [id=UnclaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalWarn: Refreshing state... [id=DiagnosisKeyTotalWarn]
aws_cloudwatch_log_metric_filter.unauthorized_new_one_time_code_requests: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequests]
aws_cloudwatch_log_metric_filter.error_logged: Refreshing state... [id=ErrorLogged]
aws_cloudwatch_log_metric_filter.five_hundred_response: Refreshing state... [id=500Response]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[1]: Refreshing state... [id=DiagnosisKeyTotal1]
aws_cloudwatch_log_metric_filter.unauthorized_upload_requests: Refreshing state... [id=UnauthorizedUploadRequests]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[6]: Refreshing state... [id=DiagnosisKeyTotal6]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[4]: Refreshing state... [id=DiagnosisKeyTotal4]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[0]: Refreshing state... [id=DiagnosisKeyTotal0]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[7]: Refreshing state... [id=DiagnosisKeyTotal7]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[2]: Refreshing state... [id=DiagnosisKeyTotal2]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[3]: Refreshing state... [id=DiagnosisKeyTotal3]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[5]: Refreshing state... [id=DiagnosisKeyTotal5]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[6]: Refreshing state... [id=UnclaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[5]: Refreshing state... [id=ClaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[7]: Refreshing state... [id=UnclaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[0]: Refreshing state... [id=UnclaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[3]: Refreshing state... [id=UnclaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[5]: Refreshing state... [id=UnclaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[2]: Refreshing state... [id=UnclaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[1]: Refreshing state... [id=UnclaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[4]: Refreshing state... [id=UnclaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.unauthorized_one_time_code_claim_requests: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequests]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[6]: Refreshing state... [id=ClaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[7]: Refreshing state... [id=ClaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[2]: Refreshing state... [id=ClaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[4]: Refreshing state... [id=ClaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[1]: Refreshing state... [id=ClaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[0]: Refreshing state... [id=ClaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[3]: Refreshing state... [id=ClaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.fatal_logged: Refreshing state... [id=FatalLogged]
aws_cloudwatch_log_metric_filter.key_clear_called: Refreshing state... [id=KeyClearCalled]
aws_lb_target_group.covidshield_key_submission_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-submission-2/b67484245795c166]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0832f6b777296d775]
aws_subnet.covidshield_public[0]: Refreshing state... [id=subnet-0fbf4adf70e11a429]
aws_subnet.covidshield_public[1]: Refreshing state... [id=subnet-0a1698d1655c0e817]
aws_subnet.covidshield_public[2]: Refreshing state... [id=subnet-052e969015b02237a]
aws_lb_target_group.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-submission/4634b35f4b1e2347]
aws_security_group.privatelink: Refreshing state... [id=sg-048b03993c8765ef5]
aws_internet_gateway.covidshield: Refreshing state... [id=igw-0f3e1bdc281e9d2bf]
aws_security_group.covidshield_key_retrieval: Refreshing state... [id=sg-050c0ea08bb934a58]
aws_security_group.covidshield_key_submission: Refreshing state... [id=sg-0144054019c7390e2]
aws_lb_target_group.covidshield_key_retrieval_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-retrieval-2/46f359cb6c1e8aae]
aws_subnet.covidshield_private[0]: Refreshing state... [id=subnet-004f7bd4f9af4d6d4]
aws_subnet.covidshield_private[1]: Refreshing state... [id=subnet-0e62dcdf9b0516543]
aws_subnet.covidshield_private[2]: Refreshing state... [id=subnet-08241ad4f1968ece8]
aws_default_network_acl.covidshield: Refreshing state... [id=acl-0931e35bd44f24857]
aws_lb_target_group.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:targetgroup/covidshield-key-retrieval/7ed459bf5f80df88]
aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f8658a462c4f2c86]
aws_cloudwatch_metric_alarm.five_hundred_response_critical: Refreshing state... [id=500ResponseCritical]
aws_cloudwatch_metric_alarm.error_logged_critical: Refreshing state... [id=ErrorLoggedCritical]
aws_cloudwatch_metric_alarm.five_hundred_response_warn: Refreshing state... [id=500ResponseWarn]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_critical: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsCritical]
aws_cloudwatch_metric_alarm.error_logged_warn: Refreshing state... [id=ErrorLoggedWarn]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_warn: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsWarn]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_warn: Refreshing state... [id=UnauthorizedUploadRequestsWarn]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_critical: Refreshing state... [id=UnauthorizedUploadRequestsCritical]
aws_iam_role_policy.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs:firehose-waf-logs-policy]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east: Refreshing state... [id=arn:aws:firehose:us-east-1:445131834497:deliverystream/aws-waf-logs-covid-shield-us-east]
aws_s3_bucket_public_access_block.firehose_waf_logs: Refreshing state... [id=covid-shield-demo-waf-logs]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs: Refreshing state... [id=arn:aws:firehose:ca-central-1:445131834497:deliverystream/aws-waf-logs-covid-shield]
aws_s3_bucket_public_access_block.cloudfront_logs: Refreshing state... [id=covid-shield-demo-cloudfront-logs]
aws_s3_bucket_policy.exposure_config: Refreshing state... [id=covid-shield-exposure-config-demo]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_warn: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsWarn]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_critical: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsCritical]
aws_cloudwatch_metric_alarm.key_clear_called_warn: Refreshing state... [id=KeyClearCalledWarn]
aws_cloudwatch_metric_alarm.fatal_logged_warn: Refreshing state... [id=FatalLoggedWarn]
aws_route_table.covidshield_public_subnet: Refreshing state... [id=rtb-0b9cc4dfb2dc7da35]
aws_security_group_rule.covidshield_key_retrieval_egress_privatelink: Refreshing state... [id=sgrule-1682999244]
aws_security_group_rule.privatelink_retrieval_ingress: Refreshing state... [id=sgrule-259250637]
aws_security_group_rule.covidshield_key_submission_egress_privatelink: Refreshing state... [id=sgrule-3211372061]
aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink: Refreshing state... [id=sgrule-1252579530]
aws_security_group.covidshield_database: Refreshing state... [id=sg-0e7193f9a26463806]
aws_security_group_rule.privatelink_submission_ingress: Refreshing state... [id=sgrule-920808560]
aws_security_group_rule.covidshield_key_submission_egress_s3_privatelink: Refreshing state... [id=sgrule-405718043]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0143beebfa374c848]
aws_vpc_endpoint.monitoring: Refreshing state... [id=vpce-0f7ef51ba75bad3cc]
aws_db_subnet_group.covidshield: Refreshing state... [id=server]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-07e0933bf18287537]
aws_vpc_endpoint.kms: Refreshing state... [id=vpce-044381c570ffd923b]
aws_security_group.covidshield_load_balancer: Refreshing state... [id=sg-0aa63ed37c38d415f]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval_cdn: Refreshing state... [id=arn:aws:wafv2:us-east-1:445131834497:global/webacl/key_retrieval_cdn/290c0829-fa25-4082-8a42-9467b4b29304]
aws_route_table_association.covidshield[0]: Refreshing state... [id=rtbassoc-0ccdcf7ec823db2c9]
aws_route_table_association.covidshield[1]: Refreshing state... [id=rtbassoc-077c53396bbde76f9]
aws_route_table_association.covidshield[2]: Refreshing state... [id=rtbassoc-0171a4c5edf535a1a]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_retrieval/6f2f44a7-242d-4626-996b-8919690096b6]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_submission/1dbee81d-3f78-4a42-adf0-beec8a1007b8]
aws_security_group_rule.covidshield_key_retrieval_egress_database: Refreshing state... [id=sgrule-2812557439]
aws_security_group_rule.covidshield_key_submission_egress_database: Refreshing state... [id=sgrule-1944979270]
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-094811ce4c6c6306e]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-0cb00a5eb43f5007d]
aws_lb.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916]
aws_lb.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7]
aws_security_group_rule.covidshield_key_submission_ingress_alb: Refreshing state... [id=sgrule-1648376102]
aws_security_group_rule.covidshield_key_retrieval_ingress_alb: Refreshing state... [id=sgrule-1089912613]
aws_rds_cluster.covidshield_server: Refreshing state... [id=server-cluster]
aws_lambda_function.submission_lambda_validate_deploy: Refreshing state... [id=SubmissionValidateBeforeTraffic]
aws_route53_record.covidshield_key_submission: Refreshing state... [id=Z028665636H79UA5DVHCV_submission.covid-alert-demo.cdssandbox.xyz._A]
aws_lb_listener.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-retrieval/b1940e8300e9e9a7/db48f982339bf76d]
aws_wafv2_web_acl_association.key_retrieval_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_retrieval/6f2f44a7-242d-4626-996b-8919690096b6,arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7]
aws_lb_listener.covidshield_key_retrieval_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-retrieval/b1940e8300e9e9a7/cbaab6b64effb70b]
aws_cloudwatch_metric_alarm.ddos_detected_retrieval: Refreshing state... [id=DDoSDetectedRetrievalALB]
aws_cloudfront_distribution.key_retrieval_distribution: Refreshing state... [id=E1QB6WEV1C30QU]
aws_lambda_function.retrieval_lambda_validate_deploy: Refreshing state... [id=RetrievalValidateBeforeTraffic]
aws_lb_listener.covidshield_key_submission_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-submission/bf583bf6161a0916/1061c8f1dc1d2645]
aws_wafv2_web_acl_association.key_submission_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:445131834497:regional/webacl/key_submission/1dbee81d-3f78-4a42-adf0-beec8a1007b8,arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916]
aws_lb_listener.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:445131834497:listener/app/covidshield-key-submission/bf583bf6161a0916/f3966ae18bf34c50]
aws_cloudwatch_metric_alarm.ddos_detected_submission: Refreshing state... [id=DDoSDetectedSubmissionALB]
aws_secretsmanager_secret_version.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD|46183918-41EE-45FB-950C-C01B6CF1E426]
aws_rds_cluster_instance.covidshield_server_instances[2]: Refreshing state... [id=server-instance-2]
aws_rds_cluster_instance.covidshield_server_instances[0]: Refreshing state... [id=server-instance-0]
aws_cloudwatch_metric_alarm.ddos_detected_cdn: Refreshing state... [id=DDoSDetectedCDN]
aws_rds_cluster_instance.covidshield_server_instances[1]: Refreshing state... [id=server-instance-1]
aws_route53_record.covidshield_key_retrieval: Refreshing state... [id=Z028665636H79UA5DVHCV_retrieval.covid-alert-demo.cdssandbox.xyz._A]
aws_ecs_task_definition.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_ecs_task_definition.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_ecs_service.covidshield_key_retrieval: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:service/CovidShield/KeyRetrieval]
aws_ecs_service.covidshield_key_submission: Refreshing state... [id=arn:aws:ecs:ca-central-1:445131834497:service/CovidShield/KeySubmission]
module.covid-shield-retrieval.aws_codedeploy_app.app: Refreshing state... [id=3b87c6fb-1ab9-41ad-9aff-d05fcd9db4fb:AppECS-CovidShield-KeyRetrieval]
aws_cloudwatch_metric_alarm.retrieval_memory_utilization_high: Refreshing state... [id=retrieval-memory-utilization-high]
aws_cloudwatch_metric_alarm.retrieval_cpu_utilization_high: Refreshing state... [id=retrieval-cpu-utilization-high]
module.covid-shield-submission.aws_codedeploy_app.app: Refreshing state... [id=ac9fb5d4-4dbe-411a-bbea-bca2c65b3d33:AppECS-CovidShield-KeySubmission]
aws_cloudwatch_metric_alarm.submission_memory_utilization_high: Refreshing state... [id=submission-memory-utilization-high]
aws_cloudwatch_metric_alarm.submission_cpu_utilization_high: Refreshing state... [id=submission-cpu-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_deployment_group.app: Refreshing state... [id=5086b4e9-139d-4018-822f-8a194741143c]
module.covid-shield-submission.aws_codedeploy_deployment_group.app: Refreshing state... [id=5620ad47-fc46-41e2-ade1-8c6eafdc618d]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      ~ id       = "c89cd3279ce0fb909d8543a5f017af0cc87794bb87f9e9094821d6c5b4bd90f1" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "rX8MZ24f1qYiaUXmNVgF"
                        },
                    ]
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.covidshield_key_submission_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_submission_task"  {
      ~ id       = "91c347006f246ca9813059936e8b5122405f8d06ff04f17b8c220970aa6dc439" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "false"
                        },
                    ]
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_account.demo will be created
  + resource "aws_api_gateway_account" "demo" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_api_gateway_api_key.metrics_api_key will be created
  + resource "aws_api_gateway_api_key" "metrics_api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "in-app-metrics-key"
      + value             = (sensitive value)
    }

  # aws_api_gateway_base_path_mapping.metrics will be created
  + resource "aws_api_gateway_base_path_mapping" "metrics" {
      + api_id      = (known after apply)
      + domain_name = "metrics.covid-alert-demo.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "demo"
    }

  # aws_api_gateway_deployment.metrics will be created
  + resource "aws_api_gateway_deployment" "metrics" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_domain_name.metrics will be created
  + resource "aws_api_gateway_domain_name" "metrics" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "metrics.covid-alert-demo.cdssandbox.xyz"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:ca-central-1:445131834497:certificate/afa9146e-c959-477b-bbd3-caafa32bba53"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_integration.metrics will be created
  + resource "aws_api_gateway_integration" "metrics" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.create_method will be created
  + resource "aws_api_gateway_method" "create_method" {
      + api_key_required     = true
      + authorization        = "NONE"
      + http_method          = "POST"
      + id                   = (known after apply)
      + request_models       = {
          + "application/json" = "metricspayload"
        }
      + request_validator_id = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
    }

  # aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method     = "POST"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = (known after apply)
      + status_code     = "200"
    }

  # aws_api_gateway_method_response.response_500 will be created
  + resource "aws_api_gateway_method_response" "response_500" {
      + http_method     = "POST"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = (known after apply)
      + status_code     = "500"
    }

  # aws_api_gateway_method_settings.method_settings will be created
  + resource "aws_api_gateway_method_settings" "method_settings" {
      + id          = (known after apply)
      + method_path = "save-metrics/POST"
      + rest_api_id = (known after apply)
      + stage_name  = "demo"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 5000
          + throttling_rate_limit                      = 10000
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_model.metrics_model will be created
  + resource "aws_api_gateway_model" "metrics_model" {
      + content_type = "application/json"
      + description  = "Metrics json schema"
      + id           = (known after apply)
      + name         = "metricspayload"
      + rest_api_id  = (known after apply)
      + schema       = jsonencode(
            {
              + $schema    = "http://json-schema.org/draft-04/schema#"
              + properties = {
                  + appos            = {
                      + default   = "null"
                      + maxLength = 20
                      + minLength = 0
                      + title     = "App os Schema"
                      + type      = "string"
                    }
                  + appversion       = {
                      + default   = "null"
                      + maxLength = 5
                      + minLength = 0
                      + title     = "App Version Schema"
                      + type      = "string"
                    }
                  + metricstimestamp = {
                      + default   = "null"
                      + maxLength = 25
                      + minLength = 0
                      + title     = "Metrics time stamp Schema"
                      + type      = "integer"
                    }
                  + payload          = {
                      + default  = []
                      + items    = {
                          + default  = {}
                          + required = [
                              + "identifier",
                              + "region",
                              + "timestamp",
                            ]
                          + title    = "payload Schema"
                          + type     = "object"
                        }
                      + minItems = 1
                      + title    = "payload Schema"
                      + type     = "array"
                    }
                  + symptomonset     = {
                      + title = "Symptom on set Schema"
                      + type  = "boolean"
                    }
                }
              + required   = [
                  + "metricstimestamp",
                  + "appversion",
                  + "appos",
                  + "payload",
                ]
              + title      = "COVID Alert Metrics Schema Version 1.4.2"
              + type       = "object"
            }
        )
    }

  # aws_api_gateway_request_validator.metrics_model will be created
  + resource "aws_api_gateway_request_validator" "metrics_model" {
      + id                          = (known after apply)
      + name                        = "save-metrics-validator"
      + rest_api_id                 = (known after apply)
      + validate_request_body       = true
      + validate_request_parameters = false
    }

  # aws_api_gateway_resource.create_resource will be created
  + resource "aws_api_gateway_resource" "create_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "save-metrics"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.metrics will be created
  + resource "aws_api_gateway_rest_api" "metrics" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Terraform Serverless api for COVID Alert metrics collection"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "save-metrics"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.metrics will be created
  + resource "aws_api_gateway_stage" "metrics" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "demo"
      + xray_tracing_enabled = true
    }

  # aws_api_gateway_usage_plan.metrics_usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "metrics_usage_plan" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "in-app-metrics-key_usage_plan"

      + api_stages {
          + api_id = (known after apply)
          + stage  = "demo"
        }
    }

  # aws_api_gateway_usage_plan_key.main will be created
  + resource "aws_api_gateway_usage_plan_key" "main" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # aws_cloudwatch_log_group.api_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 7
    }

  # aws_cloudwatch_log_group.metrics will be created
  + resource "aws_cloudwatch_log_group" "metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/save-metrics"
      + retention_in_days = 14
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_errors_above_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_errors_above_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:445131834497:alert-critical",
        ]
      + alarm_description                     = "This metric monitors 500 errors in the metrics API gateway"
      + alarm_name                            = "metrics-api-gateway-errors-above-threshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ApiName" = "save-metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "5XXError"
      + namespace                             = "AWS/ApiGateway"
      + period                                = 60
      + statistic                             = "Sum"
      + threshold                             = 95
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_max_latency_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_max_latency_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:445131834497:alert-critical",
        ]
      + alarm_description                     = "This metric monitors maximum API gateway latency for the metrics API gateway"
      + alarm_name                            = "metrics-api-gateway-above-maximum-latency"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ApiName" = "save-metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p95"
      + id                                    = (known after apply)
      + metric_name                           = "Latency"
      + namespace                             = "AWS/ApiGateway"
      + period                                = 60
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_min_invocations_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_min_invocations_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:445131834497:alert-critical",
        ]
      + alarm_description                     = "This metric monitors minimum API gateway invocations for the metrics API gateway"
      + alarm_name                            = "metrics-api-gateway-below-minimum-invocations"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ApiName" = "save-metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Count"
      + namespace                             = "AWS/ApiGateway"
      + period                                = 60
      + statistic                             = "Sum"
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.save_metrics_average_duration will be created
  + resource "aws_cloudwatch_metric_alarm" "save_metrics_average_duration" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:445131834497:alert-critical",
        ]
      + alarm_description                     = "This metric monitors average duration for the save_metrics lambda"
      + alarm_name                            = "save-metrics-average-duration"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "save-metrics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p99"
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0f08d59ec610efa9f"
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:445131834497:task-definition/KeyRetrieval:21" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "rX8MZ24f1qYiaUXmNVgF"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-hmac-key-ymzi27-z6S5xz"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-retrieval-env-ecdsa-key-ymzi27-HB1VtN"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-metric-password-ymzi27-iaJwHm"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 21 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_submission must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_submission" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:445131834497:task-definition/KeySubmission:21" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "false"
                        },
                      - {
                          - name  = "ENV"
                          - value = "demo"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "445131834497.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:key-submission-env-key-claim-token-ymzi27-ctDs6X"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:445131834497:secret:server-database-url-ymzi27-AhOoLD"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeySubmission" -> (known after apply)
      ~ revision                 = 21 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "save-metrics"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::in-app-metrics-445131834497/*",
                        ]
                      + Sid      = "VisualEditor0"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
    }

  # aws_iam_role.api_gatway_cloudwatch_role will be created
  + resource "aws_iam_role" "api_gatway_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "save-metricsapi_gateway_cloudwatch_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "save-metrics.role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "save-metrics.role"
    }

  # aws_lambda_function.metrics will be created
  + resource "aws_lambda_function" "metrics" {
      + arn                            = (known after apply)
      + description                    = "Lambda function for collecting metrics records"
      + filename                       = "/tmp/lambda_create_metric.js.zip"
      + function_name                  = "save-metrics"
      + handler                        = "create_metric.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "c1ZhwemChYAtNmO7kZaC9jyYFopoBRa65CKRAmosei0="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "raw_metrics"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = [
              + "subnet-004f7bd4f9af4d6d4",
              + "subnet-08241ad4f1968ece8",
              + "subnet-0e62dcdf9b0516543",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "save-metrics"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # aws_lb.covidshield_key_retrieval will be updated in-place
  ~ resource "aws_lb" "covidshield_key_retrieval" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-retrieval/b1940e8300e9e9a7"
        name                       = "covidshield-key-retrieval"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-retrieval"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.covidshield_key_submission will be updated in-place
  ~ resource "aws_lb" "covidshield_key_submission" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:445131834497:loadbalancer/app/covidshield-key-submission/bf583bf6161a0916"
        name                       = "covidshield-key-submission"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-submission"
        }
        # (14 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-account-bucket445131834497"
          ~ enabled = false -> true
          + prefix  = "445131834497/elb_logs_v2"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_rds_cluster.covidshield_server will be updated in-place
  ~ resource "aws_rds_cluster" "covidshield_server" {
      ~ deletion_protection                 = false -> true
        id                                  = "server-cluster"
        tags                                = {
            "CostCentre" = "CovidShield"
            "Name"       = "server-cluster"
        }
        # (31 unchanged attributes hidden)
    }

  # aws_route53_record.covidshield_metrics_submission will be created
  + resource "aws_route53_record" "covidshield_metrics_submission" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "metrics.covid-alert-demo.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z028665636H79UA5DVHCV"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.cloudfront_logs will be updated in-place
  ~ resource "aws_s3_bucket" "cloudfront_logs" {
        id                          = "covid-shield-demo-cloudfront-logs"
        tags                        = {}
        # (9 unchange (truncated)...```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*